In [1]:
import numpy as np 
import pandas as pd

In [2]:
t = (1,2,3,4)
t[1:3]

(2, 3)

In [3]:
dictionary = {"name":["baraa","saif","muhamet","aseel","rami","can"],
             "age":[12,34,56,78,None,12],
             "note":[123,456,78,87654,None,89]}
dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

      name   age     note
0    baraa  12.0    123.0
1     saif  34.0    456.0
2  muhamet  56.0     78.0
3    aseel  78.0  87654.0
4     rami   NaN      NaN
5      can  12.0     89.0

In [5]:
df = pd.read_csv(r"C:\Users\SaiF\Desktop\biostats.csv")
print(df)

    Name         Sex   Age   Height    Weight
0   Alex         "M"    41        74      170
1   Bert         "M"    42        68      166
2   Carl         "M"    32        70      155
3   Dave         "M"    39        72      167
4   Elly         "F"    30        66      124
5   Fran         "F"    33        66      115
6   Gwen         "F"    26        64      121
7   Hank         "M"    30        71      158
8   Ivan         "M"    53        72      175
9   Jake         "M"    32        69      143
10  Kate         "F"    47        69      139
11  Luke         "M"    34        72      163
12  Myra         "F"    23        62       98
13  Neil         "M"    36        75      160
14  Omar         "M"    38        70      145
15  Page         "F"    31        67      135
16  Quin         "M"    29        71      176
17  Ruth         "F"    28        65      131

In [6]:
head = dataframe1.head() 
print(head)

      name   age     note
0    baraa  12.0    123.0
1     saif  34.0    456.0
2  muhamet  56.0     78.0
3    aseel  78.0  87654.0
4     rami   NaN      NaN

In [7]:
tail = dataframe1.tail()
print(tail)

      name   age     note
1     saif  34.0    456.0
2  muhamet  56.0     78.0
3    aseel  78.0  87654.0
4     rami   NaN      NaN
5      can  12.0     89.0

In [8]:
print(dataframe1.columns)

Index(['name', 'age', 'note'], dtype='object')

In [9]:
print(dataframe1.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   note    5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 276.0+ bytes
None

In [10]:
print(dataframe1.dtypes)

name     object
age     float64
note    float64
dtype: object

In [11]:
print(dataframe1.describe())

             age         note
count   5.000000      5.00000
mean   38.400000  17680.00000
std    28.684491  39116.96814
min    12.000000     78.00000
25%    12.000000     89.00000
50%    34.000000    123.00000
75%    56.000000    456.00000
max    78.000000  87654.00000

In [12]:
print(dataframe1["name"]) 
print(dataframe1.loc[:, "age"])            
dataframe1["new_future"] = [1,2,3,4,5,6] 
print(dataframe1.loc[:3,"age"])
print(dataframe1.loc[:3, "name":"note"])
print(dataframe1.loc[::-1])

0      baraa
1       saif
2    muhamet
3      aseel
4       rami
5        can
Name: name, dtype: object
0    12.0
1    34.0
2    56.0
3    78.0
4     NaN
5    12.0
Name: age, dtype: float64
0    12.0
1    34.0
2    56.0
3    78.0
Name: age, dtype: float64
      name   age     note
0    baraa  12.0    123.0
1     saif  34.0    456.0
2  muhamet  56.0     78.0
3    aseel  78.0  87654.0
      name   age     note  new_future
5      can  12.0     89.0           6
4     rami   NaN      NaN           5
3    aseel  78.0  87654.0           4
2  muhamet  56.0     78.0           3
1     saif  34.0    456.0           2
0    baraa  12.0    123.0           1

In [13]:
print(dataframe1.loc[:, "new_future"])

0    1
1    2
2    3
3    4
4    5
5    6
Name: new_future, dtype: int64

In [14]:
print(dataframe1.loc[:3, ["name","note"]])

      name     note
0    baraa    123.0
1     saif    456.0
2  muhamet     78.0
3    aseel  87654.0

In [15]:
print(dataframe1.loc[:,:"age"])

      name   age
0    baraa  12.0
1     saif  34.0
2  muhamet  56.0
3    aseel  78.0
4     rami   NaN
5      can  12.0

In [16]:
print(dataframe1.iloc[:,[2]])

      note
0    123.0
1    456.0
2     78.0
3  87654.0
4      NaN
5     89.0

In [17]:
filtre1 = dataframe1.age>10
dataframe1["bool"]= filtre1
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  12.0   True
1  34.0   True
2  56.0   True
3  78.0   True
4   NaN  False
5  12.0   True

In [18]:
type(filtre1)

pandas.core.series.Series

In [19]:
filtrelenmis_data= dataframe1[filtre1] 
print(filtrelenmis_data)

      name   age     note  new_future  bool
0    baraa  12.0    123.0           1  True
1     saif  34.0    456.0           2  True
2  muhamet  56.0     78.0           3  True
3    aseel  78.0  87654.0           4  True
5      can  12.0     89.0           6  True

In [20]:
filtre2 = dataframe1.note>100
filtrelenmis_data2 = dataframe1[filtre2&filtre1] 
print(filtrelenmis_data2)

    name   age     note  new_future  bool
0  baraa  12.0    123.0           1  True
1   saif  34.0    456.0           2  True
3  aseel  78.0  87654.0           4  True

In [21]:
dataframe1[dataframe1.age>20]

      name   age     note  new_future  bool
1     saif  34.0    456.0           2  True
2  muhamet  56.0     78.0           3  True
3    aseel  78.0  87654.0           4  True

In [22]:
mean1 = dataframe1.note.mean()
print(mean1)
mean_np= np.mean(dataframe1.note) 
print(mean_np)

17680.0
17680.0

In [23]:
dataframe1.dropna(inplace=True) 
dataframe1

      name   age     note  new_future  bool
0    baraa  12.0    123.0           1  True
1     saif  34.0    456.0           2  True
2  muhamet  56.0     78.0           3  True
3    aseel  78.0  87654.0           4  True
5      can  12.0     89.0           6  True

In [24]:
print(dataframe1.note.mean())
dataframe1["mean"]= ["bad" if dataframe1.note.mean()>each else "good" for each in dataframe1.note]
dataframe1

17680.0

      name   age     note  new_future  bool  mean
0    baraa  12.0    123.0           1  True   bad
1     saif  34.0    456.0           2  True   bad
2  muhamet  56.0     78.0           3  True   bad
3    aseel  78.0  87654.0           4  True  good
5      can  12.0     89.0           6  True   bad

In [25]:
dataframe1.columns = [each.upper() for each in dataframe1.columns] 

dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'NEW_FUTURE', 'BOOL', 'MEAN'], dtype='object')

In [26]:
dataframe1.drop(["NEW_FUTURE"],axis=1,inplace=True)
dataframe1

      NAME   AGE     NOTE  BOOL  MEAN
0    baraa  12.0    123.0  True   bad
1     saif  34.0    456.0  True   bad
2  muhamet  56.0     78.0  True   bad
3    aseel  78.0  87654.0  True  good
5      can  12.0     89.0  True   bad

In [27]:
data1 = dataframe1.head()     
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

      NAME   AGE     NOTE  BOOL  MEAN
0    baraa  12.0    123.0  True   bad
1     saif  34.0    456.0  True   bad
2  muhamet  56.0     78.0  True   bad
3    aseel  78.0  87654.0  True  good
5      can  12.0     89.0  True   bad
0    baraa  12.0    123.0  True   bad
1     saif  34.0    456.0  True   bad
2  muhamet  56.0     78.0  True   bad
3    aseel  78.0  87654.0  True  good
5      can  12.0     89.0  True   bad

In [28]:
data_contact2 = pd.concat([data1,data2],axis=1)
data_contact2

      NAME   AGE     NOTE  BOOL  MEAN     NAME   AGE     NOTE  BOOL  MEAN
0    baraa  12.0    123.0  True   bad    baraa  12.0    123.0  True   bad
1     saif  34.0    456.0  True   bad     saif  34.0    456.0  True   bad
2  muhamet  56.0     78.0  True   bad  muhamet  56.0     78.0  True   bad
3    aseel  78.0  87654.0  True  good    aseel  78.0  87654.0  True  good
5      can  12.0     89.0  True   bad      can  12.0     89.0  True   bad

In [29]:
dataframe1["new_age"] = [each*2 for each in dataframe1.AGE]
dataframe1

      NAME   AGE     NOTE  BOOL  MEAN  new_age
0    baraa  12.0    123.0  True   bad     24.0
1     saif  34.0    456.0  True   bad     68.0
2  muhamet  56.0     78.0  True   bad    112.0
3    aseel  78.0  87654.0  True  good    156.0
5      can  12.0     89.0  True   bad     24.0